dlls/BingPagingRequestTemplate.xml

<?xml version="1.0" encoding="utf-8"?><e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"><e:Body><s:SearchWithNifEnabled xmlns:s="http://schemas.microsoft.com/MobileSearch/v1/Search" xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><s:request><Context><ApplicationId>%1</ApplicationId><UserId>%2</UserId><Version>%3</Version><Culture>%4</Culture></Context><Properties><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>Highlight</Key><Value>true</Value></KeyValueOfstringstring></Properties><Queries><QueryInformation><Domains><DomainInformation><Domain>%9</Domain><Range><Count>%11</Count><Start>%10</Start></Range></DomainInformation></Domains><Locations><Location><EntityType>Address</EntityType><LocationInformation><Coordinate xmlns:b="http://schemas.microsoft.com/MobileSearch/v1/Common/metadata"><b:Latitude>%6</b:Latitude><b:Longitude>%7</b:Longitude></Coordinate><Name>%8</Name><Offset>0</Offset></LocationInformation></Location></Locations><QueryString>%5</QueryString></QueryInformation></Queries></s:request></s:SearchWithNifEnabled></e:Body></e:Envelope>
